nrf52dev/nrf52_sdk_14.2/ble_app_buttonless_dfu/source/main.c
/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch (p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            NRF_LOG_INFO("Connected to a previously bonded device.");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            NRF_LOG_INFO("Connection secured: role: %d, conn_handle: 0x%x, procedure: %d.",
                         ble_conn_state_role(p_evt->conn_handle),
                         p_evt->conn_handle,
                         p_evt->params.conn_sec_succeeded.procedure);
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
            /* Often, when securing fails, it shouldn't be restarted, for security reasons.
             * Other times, it can be restarted directly.
             * Sometimes it can be restarted, but only after changing some Security Parameters.
             * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
             * Sometimes it is impossible, to secure the link, or the peer device does not support it.
             * How to handle this error is highly application dependent. */
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = true};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                APP_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {
            advertising_start(false);
        } break;

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        {
            // The local database has likely changed, send service changed indications.
            pm_local_database_has_changed();
        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
        } break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
        } break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
        } break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }
}
#define HI_UINT16(a) (((a) >> 8) & 0xFF)
#define LO_UINT16(a) ((a) & 0xFF)
uint8_t advertData_Ex[] =
{
  // Flags; this sets the device to use limited discoverable
  // mode (advertises for 30 seconds at a time) instead of general
  // discoverable mode (advertises indefinitely)
  0x02,   // length of this data
  0x01,
  0x06,

  // service UUID, to notify central devices what services are included
  // in this peripheral
  0x0B,   // length of this data
  //??????? 8???
  0x00,   // ???
  0x00,   // ???
  0x00,   // ???
  0x00,   // ???
  0x00,   // ???
  0x00,   // ???
  0x00,   // ???
  0x00,   // ???
  
  0x02,      // some of the UUID's, but not all
  0xFF,
  0xFF,
};
// GAP - SCAN RSP data (max size = 31 bytes)
static uint8_t scanRspData[] =
{
  // complete name
  0x05,   // length of this data
  0x09,
  0x53,   // 'S'
  0x43,   // 'C'
  0x42,   // 'B'
  0x41,   // 'A'

  // connection interval range
  0x05,   // length of this data
  0x12,
  LO_UINT16( 80 ),   // 100ms
  HI_UINT16( 80 ),
  LO_UINT16( 800 ),   // 1s
  HI_UINT16( 800 ),

  // Tx power level
  0x02,   // length of this data
  0x0A,
  0       // 0dBm
};
static void update_adv_data(void *p_context)
{
	static uint8_t index = 0;
	nrf_saadc_value_t saadc_val;
	float val;
	unsigned int val_t;
	nrf_gpio_pin_set(3);
	nrf_drv_saadc_sample_convert(0,&saadc_val);
	nrf_gpio_pin_clear(3);
	val = saadc_val*3.6/16384;
	val_t = val*100;
	index ++;
	advertData_Ex[8] = index; 
	advertData_Ex[9] = sys_config.cnt_r;
	advertData_Ex[5] = val_t/100%100;
	advertData_Ex[6] = val_t/10%10;
	advertData_Ex[7] = val_t%10;
	sd_ble_gap_adv_data_set(advertData_Ex,sizeof(advertData_Ex), scanRspData,sizeof(scanRspData));
}
static void read_key_state(void *p_context)
{
	if(nrf_gpio_pin_read(13) == 0)
	{
		advertData_Ex[9] ++;
		sd_ble_gap_adv_data_set(advertData_Ex,sizeof(advertData_Ex), scanRspData,sizeof(scanRspData));
	}
}
/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{

    // Initialize timer module.
    uint32_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.

    /* YOUR_JOB: Create any timers to be used by the application.
                 Below is an example of how to create a timer.
                 For every new timer needed, increase the value of the macro APP_TIMER_MAX_TIMERS by
                 one.
       uint32_t err_code;
       err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
       APP_ERROR_CHECK(err_code); */
		err_code = app_timer_create(&m_update_adv_timer, APP_TIMER_MODE_REPEATED, update_adv_data);
		APP_ERROR_CHECK(err_code);
	
		err_code = app_timer_create(&m_read_key_timer, APP_TIMER_MODE_REPEATED, read_key_state);
		APP_ERROR_CHECK(err_code);
}


