nrf52dev/nrf52_sdk_14.2/ble_app_buttonless_dfu/source/main.c
    memset(&init, 0, sizeof(init));

		//广播数据设置
    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;//广播类型，全名
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE; //Discovery Mode
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);//uuid个数
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;//uuid列表指针
		
		//广播模式配置
    init.config.ble_adv_fast_enabled  = true;	//启动快速广播
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;//快速广播间隔
    init.config.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;//快速广播时间

		//广播事件处理
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    uint32_t err_code;
    bsp_event_t startup_event;

    //err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, bsp_event_handler);
    //APP_ERROR_CHECK(err_code);

    //err_code = bsp_btn_ble_init(NULL, &startup_event);
    //APP_ERROR_CHECK(err_code);
		nrf_gpio_cfg_output(3);  
		nrf_gpio_cfg_output(12); 
		nrf_gpio_cfg_output(14);	
		nrf_gpio_cfg_input(13,NRF_GPIO_PIN_NOPULL);
		nrf_gpio_pin_set(12);
		nrf_gpio_pin_set(14);
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for the Power manager.
 */
static void log_init(void)
{
    uint32_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief   Function for initializing the GATT module.
 * @details The GATT module handles ATT_MTU and Data Length update procedures automatically.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEBUG("advertising is started");
    }
}

static void power_management_init(void)
{
    uint32_t err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}
void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
	
}
void saadc_init(void)
{
	ret_code_t err_code;
	
	nrf_saadc_channel_config_t channel_config = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN2);
	
	err_code = nrf_drv_saadc_init(NULL,saadc_callback);
	APP_ERROR_CHECK(err_code);
	//adc
	err_code = nrf_drv_saadc_channel_init(0,&channel_config);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    //log_init();

    timers_init();
	
		
		TabrApp_InitAppFlash();
		if(TabrApp_ReadAllDataFromeFlash() != 1)
    {
        TabrApp_SetAllParaDefault();
        TabrApp_WriteAllDataToFlash();
    } 
		else
		{
			sys_config.cnt_r++;
			TabrApp_WriteAllDataToFlash();
		}
		saadc_init();
    power_management_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    peer_manager_init();
    gap_params_init();
    gatt_init();
    advertising_init();//广播初始化
    services_init();
    conn_params_init();

    NRF_LOG_INFO("Application started\n");

    // Start execution.
    application_timers_start();
    advertising_start(erase_bonds);
		scan_start();

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            nrf_pwr_mgmt_run();
        }
    }
}

/**
 * @}
 */
